<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use DB;

class BankTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('banks')->truncate();
        $banks = [
            '경남은행',
            '국민은행',
            '광주은행',
            '기업은행',
            '농협중앙회',
            '단위농협(축협)',
            '대구은행',
            '대화은행',
            '부산은행',
            '산업은행',
            '상호저축은행',
            '새마을금고',
            '수출입은행',
            '수협',
            '신한은행',
            '신협',
            '씨티은행',
            '우리은행',
            '우체국',
            '외환은행',
            '전북은행',
            '제주은행',
            '카카오뱅크',
            '케이뱅크',
            '한국은행',
            '하나은행',
            'SC제일은행',
            '도이치은행',
            '모건스탠리',
            '미쓰비시도쿄UFJ은행',
            '미즈호은행',
            '비엔피파리바은행',
            '알비에스피엘씨은행',
            '제이피모간체이스은행',
            '중국공상은행',
            '중국은행',
            'BOA은행',
            'HSBC은행',
            '기술보증기금 ',
            '산림조합중앙회',
            '서울보증보험',
            '신용보증기금',
            '한국전자금융(주)',
            '한국정책금융공사',
            '한국주택금융공사',
            '교보증권',
            '동부증권',
            '대신증권',
            '대우증권',
            '메리츠종합금융증권',
            '미래에셋증권',
            '부국증권',
            '삼성증권',
            '신영증권',
            '신한금융투자',
            '아이엠투자증권',
            '우리투자증권',
            '유안타증권',
            '유진투자증권',
            '이트레이드증권',
            '키움증권',
            '하나대투증권',
            '하이투자증권',
            '한국투자증권',
            '한화투자증권',
            '현대증권',
            'HMC투자증권',
            'LIG투자증권',
            'NH농협증권',
            'SK증권',
        ];

        foreach($banks as $bank) {
            DB::table('banks')->insert([
                'name'=> $bank,
            ]);
        }
    }

}
